use db_lili;
--  ------------- 相关字段更改 -----------------
ALTER TABLE t_enroll_order ADD COLUMN isdel tinyint(4) NOT NULL DEFAULT '0' COMMENT '状态：0代表未删除，1代表已删除';

-- 佛山的编号之前配置错误，需要更正-------------
UPDATE t_enroll_package_template SET city_id = 100103 WHERE city_id = 100104;
UPDATE t_enroll_progress_template SET city_id = 100103 WHERE city_id = 100104;
UPDATE t_enroll_progress_user SET city_id = 100103 WHERE city_id = 100104;
UPDATE t_enroll_order SET city_id = 100103 WHERE city_id = 100104;
UPDATE t_enroll_material_address SET city_id = 100103 WHERE city_id = 100104;
UPDATE t_enroll_material SET city_id = 100103 WHERE city_id = 100104;


--代码插入扣款金额都为负，更新原数据金额为负-------
update t_u_deposit set money = -money;
update t_u_money set changeValue=-changeValue where payWay='yinlian' and remark='预扣提现金额';


-- -----------更新报名包模板-----------------
TRUNCATE t_enroll_package_template;

INSERT INTO t_enroll_package_template VALUES 
(null,100100,'深圳',199800,'身份证、居住证、体检表、照片','深圳.jpg','http://www.lilixc.com/examination-registration.html','科目一报考费=70+科目二报考费=130+科目三报考费=280+工本费=10+长训费=500+档案费=1008','1、培训范围：C1、C2+2、年龄：C1、C2牌18-70周岁+3、身高：C1、C2牌不限身高+4、视力：C1、C2牌≧4.9（矫正）+5、听力无障碍+6、左下肢残缺允许报C2牌+7、上肢健全+8、躯干、颈部无运动障碍+9、辨色力无红绿色弱/色盲+10、无考任何驾照经历+11、三年内无吸食、注射毒品行为',
'本地居民+身份证复印件：2份（正反面）+小一寸白底照片12张+数码照相回执原件1份+驾照体检表+外地居民+身份证复印件：2份（正反面）+小一寸白底照片12张+数码照相回执原件1份+体检表+有效居住证复印件2份+港澳台+身份证复印件2份（正反面）+回乡证复印件2份+临时住宿登记表原件1份+小一寸白底照片12张+体检表+数码照相回执原件1份+现役军人+身份证复印件：2份（正反面）+小一寸白底照片12张+数码照相回执原件1份+军官证复印件+团级以上单位出具的申请人现实际驻地的住址证明+团级以上医疗机构的出具的身体检查结果',1,'深圳报名流程.jpg',null,1,0,null,null,null,null),
(null,100102,'广州',199800,'身份证、居住证、体检表、照片','广州.jpg','http://www.lilixc.com/examination-registration.html','科目一报考费=70+科目二报考费=130+科目三报考费=280+工本费=10+长训费=500+档案费=1008','1、培训范围：C1、C2+2、年龄：C1、C2牌18-70周岁+3、身高：C1、C2牌不限身高+4、视力：C1、C2牌≧4.9（矫正）+5、听力无障碍+6、左下肢残缺允许报C2牌+7、上肢健全+8、躯干、颈部无运动障碍+9、辨色力无红绿色弱/色盲+10、无考任何驾照经历+11、三年内无吸食、注射毒品行为',
'本地居民+身份证复印件4份（正反面）+驾驶证规格相片16张（含驾驶证相片回执原件及光碟1张）+驾照体检表+外地居民+身份证复印件4份（正反面）+驾驶证规格相片16张（含驾驶证相片回执原件及光碟1张）+驾照体检表+居住证复件1份（正反面）+港澳台+身份证复印件4份（正反面）+回乡证复印件2份+临时住宿登记表原件1份+驾驶证规格相片16张（含驾驶证相片回执原件及光碟1张）+驾照体检表+现役军人+身份证复印件4份（正反面）+驾驶证规格相片16张（含驾驶证相片回执原件及光碟1张）+军官证复印件+团级以上单位出具的申请人现实际驻地的住址证明+团级以上医疗机构的出具的身体检查结果',1,'广州报名流程.jpg',null,1,0,null,null,null,null),
(null,100101,'东莞',318800,'身份证、居住证、体检表、照片','东莞.jpg','http://www.lilixc.com/examination-registration.html','科目一报考费=70+科目二报考费=130+科目三报考费=280+工本费=10+长训费=500+档案费=1008+入场费=1190','1、培训范围：C1、C2+2、年龄：C1、C2牌18-70周岁+3、身高：C1、C2牌不限身高+4、视力：C1、C2牌≧4.9（矫正）+5、听力无障碍+6、左下肢残缺允许报C2牌+7、上肢健全+8、躯干、颈部无运动障碍+9、辨色力无红绿色弱/色盲+10、无考任何驾照经历+11、三年内无吸食、注射毒品行为',
'本地居民+身份证复印件2份（正反面）+小一寸彩色白底免冠照14张+数码照相回执原件1份+驾照体检表+外地居民+身份证复印件2份（正反面）+小一寸彩色白底免冠照14张+数码照相回执原件1份+居住证复件1份（正反面）+驾照体检表+港澳台+身份证复印件2份（正反面）+回乡证复印件2份+临时住宿登记表原件1份+小一寸彩色白底免冠照14张+数码照相回执原件1份+驾照体检表+现役军人+身份证复印件2份（正反面）+小一寸彩色白底免冠照14张+数码照相回执原件1份+军官证复印件+团级以上单位出具的申请人现实际驻地的住址证明+团级以上医疗机构的出具的身体检查结果',1,'东莞报名流程.jpg',null,1,0,null,null,null,null),
(null,100103,'佛山',199800,'身份证、居住证、体检表、照片','佛山.jpg','http://www.lilixc.com/examination-registration.html','科目一报考费=70+科目二报考费=130+科目三报考费=280+工本费=10+长训费=500+档案费=1008','1、培训范围：C1、C2+2、年龄：C1、C2牌18-70周岁+3、身高：C1、C2牌不限身高+4、视力：C1、C2牌≧4.9（矫正）+5、听力无障碍+6、左下肢残缺允许报C2牌+7、上肢健全+8、躯干、颈部无运动障碍+9、辨色力无红绿色弱/色盲+10、无考任何驾照经历+11、三年内无吸食、注射毒品行为',
'本地居民+身份证复印件4份（正反面）+小一寸彩色白底免冠16张+数码照相回执原件1份+驾照体检表+外地居民+身份证复印件4份（正反面）+小一寸彩色白底免冠16张+数码照相回执原件1份+驾照体检表+居住证复件1份（正反面）+港澳台+身份证复印件4份（正反面）+回乡证复印件2份+临时住宿登记表原件1份+小一寸彩色白底免冠16张+数码照相回执原件1份+驾照体检表+现役军人+身份证复印件4份（正反面）+小一寸彩色白底免冠16张+数码照相回执原件1份+军官证复印件+团级以上单位出具的申请人现实际驻地的住址证明+团级以上医疗机构的出具的身体检查结果',1,'佛山报名流程.jpg',null,1,0,null,null,null,null);


-- 报名地址中联系方式冗余--
UPDATE `t_enroll_material_address` set phone = mobile;







