-- 学员表添加冗余字段
ALTER TABLE t_u_student
ADD `extra` varchar(255) DEFAULT NULL COMMENT '冗余：用于存放临时数据等';

-- 现网进度更新，特别注意！！！这里只能执行一次！！！
UPDATE t_enroll_progress_user set next_step =4 WHERE next_step = 5;
UPDATE t_enroll_progress_user set next_step =5 WHERE next_step = 6;
UPDATE t_enroll_progress_user set next_step =6 WHERE next_step = 7;
UPDATE t_enroll_progress_user set next_step =6 WHERE next_step = 2001;
UPDATE t_u_student set applyexam = 4 WHERE applyexam = 5;
UPDATE t_u_student set applyexam = 5 WHERE applyexam = 6;
UPDATE t_u_student set applyexam = 6 WHERE applyexam = 7;
UPDATE t_u_student set applyexam = 6 WHERE applyexam = 2001;

-- 更新报名进度模板
TRUNCATE t_enroll_progress_template;
INSERT INTO `t_enroll_progress_template` VALUES 
(1, 1, 100100, 1, 1, 2, 1, 'progress_drivelicense', '报名', 'dpage_enrolllist', '', '', '开启您的驾考之旅', '开启您的驾考之旅', '开启您的驾考之旅', '开启您的驾考之旅', 1, 0, 0, 0, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 1, 1),
(2, 1, 100100, 2, 1, 3, 2, 'progress_drivelicense', '支付', 'step_2', '', '', '您有报名订单需要支付', '您已支付报考学费{1}元', '您已支付报考学费{1}元', '您的报名订单支付失败，请重新支付', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 2, 1),
(3, 1, 100100, 3, 1, 4, 3, 'progress_messages', '', 'step_3', '', '', '填写个人资料', '您已经填写基本信息', '您已经填写基本信息', '', 1, 1, 1, 0, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 3, 1),
(4, 1, 100100, 4, 1, NULL, NULL, 'progress_messages', '', 'step_4', '', '', '{1}你好,需要您线下邮寄资料给我们，具体资料点击查看详情', '资料已寄出，我们将在收到资料14个工作日内完成报名', '资料正在受理中，请耐心等待', '您邮寄的资料不全，请补寄给我们，具体请点击查看详情', 1, 1, 1, 1, '', '您的资料已收到', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 4, 1),
(5, 1, 100100, 5, 1, 6, 5, 'progress_drivelicense', '', 'step_5', '', '', '资料正在受理中，请耐心等待', '资料正在受理中，请耐心等待', '资料正在受理中，请耐心等待', '', 0, 0, 0, 0, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(6, 1, 100100, 6, 1, 101, NULL, 'progress_drivelicense', '', '', '', '', '资料正在受理中，请耐心等待', '资料正在受理中，请耐心等待', '您已成功报考{1}驾校，报考准驾车型为{2}，流水号为{3}', '受理失败，点击查看详情，喱喱客服将会与您联系', 0, 0, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(7, 1, 100100, 101, 1, 201, 101, 'progress_drivelicense', '', '', '', '', '等待预约理论课', '约课中', '已约理论课', '缺理论课', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(8, 1, 100100, 201, 1, 301, 201, 'progress_drivelicense', '', '', '', '', '未模拟考试', '', '模拟考试达标', '模拟考试未达标', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(9, 1, 100100, 301, 1, 302, 301, 'progress_subjectone', '科目一', '', '', '', '科一约考排队中', '', '科一排队成功', '科一约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(10, 1, 100100, 302, 1, 401, 301, 'progress_subjectone', '', '', '', '', '已约考科一', '', '科一合格', '科一不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(11, 1, 100100, 401, 1, 402, 401, 'progress_subjecttwo', '科目二', '', '', '', '科二约考排队中', '', '科二排队成功', '科二约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(12, 1, 100100, 402, 1, 501, 401, 'progress_subjecttwo', '', '', '', '', '已约考科二', '', '科二合格', '科二不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(13, 1, 100100, 501, 1, 502, 501, 'progress_longtraining', '长训', '', '', '', '长训约考排队中', '', '长训排队成功', '长训约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(14, 1, 100100, 502, 1, 601, 501, 'progress_longtraining', '', '', '', '', '已约考长训', '', '长训合格', '长训不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(15, 1, 100100, 601, 1, 602, 601, 'progress_subjectthree', '科目三', '', '', '', '科三约考排队中', '', '科三排队成功', '科三约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(16, 1, 100100, 602, 1, 701, 601, 'progress_subjectthree', '', '', '', '', '已约考科三', '', '科三合格', '科三不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(17, 1, 100100, 701, 1, NULL, 701, 'progress_subjectfour', '科目四', '', '', '', '已约考科四', '', '已拿证', '科四不合格', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(18, 2, 100101, 1, 1, 2, 1, 'progress_drivelicense', '报名', 'dpage_enrolllist', '', '', '开启您的驾考之旅', '开启您的驾考之旅', '开启您的驾考之旅', '开启您的驾考之旅', 1, 0, 0, 0, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 1, 1),
(19, 2, 100101, 2, 1, 3, 2, 'progress_drivelicense', '支付', 'step_2', '', '', '您有报名订单需要支付', '您已支付报考学费{1}元', '您已支付报考学费{1}元', '您的报名订单支付失败，请重新支付', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 2, 1),
(20, 2, 100101, 3, 1, 4, 3, 'progress_messages', '', 'step_3', '', '', '填写个人资料', '您已经填写基本信息', '您已经填写基本信息', '', 1, 1, 1, 0, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 3, 1),
(21, 2, 100101, 4, 1, NULL, NULL, 'progress_messages', '', 'step_4', '', '', '{1}你好,需要您线下邮寄资料给我们，具体资料点击查看详情', '资料已寄出，我们将在收到资料14个工作日内完成报名', '资料正在受理中，请耐心等待', '您邮寄的资料不全，请补寄给我们，具体请点击查看详情', 1, 1, 1, 1, '', '您的资料已收到', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 4, 1),
(22, 2, 100101, 5, 1, 6, 5, 'progress_drivelicense', '', 'step_5', '', '', '资料正在受理中，请耐心等待', '资料正在受理中，请耐心等待', '资料正在受理中，请耐心等待', '', 0, 0, 0, 0, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(23, 2, 100101, 6, 1, 101, NULL, 'progress_drivelicense', '', '', '', '', '资料正在受理中，请耐心等待', '资料正在受理中，请耐心等待', '您已成功报考{1}驾校，报考准驾车型为{2}，流水号为{3}', '受理失败，点击查看详情，喱喱客服将会与您联系', 0, 0, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(24, 2, 100101, 101, 1, 201, 101, 'progress_drivelicense', '', '', '', '', '等待预约理论课', '约课中', '已约理论课', '缺理论课', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(25, 2, 100101, 201, 1, 301, 201, 'progress_drivelicense', '', '', '', '', '未模拟考试', '', '模拟考试达标', '模拟考试未达标', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(26, 2, 100101, 301, 1, 302, 301, 'progress_subjectone', '科目一', '', '', '', '科一约考排队中', '', '科一排队成功', '科一约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(27, 2, 100101, 302, 1, 401, 301, 'progress_subjectone', '', '', '', '', '已约考科一', '', '科一合格', '科一不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(28, 2, 100101, 401, 1, 402, 401, 'progress_subjecttwo', '科目二', '', '', '', '科二约考排队中', '', '科二排队成功', '科二约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(29, 2, 100101, 402, 1, 501, 401, 'progress_subjecttwo', '', '', '', '', '已约考科二', '', '科二合格', '科二不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(30, 2, 100101, 501, 1, 502, 501, 'progress_longtraining', '长训', '', '', '', '长训约考排队中', '', '长训排队成功', '长训约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(31, 2, 100101, 502, 1, 601, 501, 'progress_longtraining', '', '', '', '', '已约考长训', '', '长训合格', '长训不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(32, 2, 100101, 601, 1, 602, 601, 'progress_subjectthree', '科目三', '', '', '', '科三约考排队中', '', '科三排队成功', '科三约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(33, 2, 100101, 602, 1, 701, 601, 'progress_subjectthree', '', '', '', '', '已约考科三', '', '科三合格', '科三不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(34, 2, 100101, 701, 1, NULL, 701, 'progress_subjectfour', '科目四', '', '', '', '已约考科四', '', '已拿证', '科四不合格', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(35, 3, 100102, 1, 1, 2, 1, 'progress_drivelicense', '报名', 'dpage_enrolllist', '', '', '开启您的驾考之旅', '开启您的驾考之旅', '开启您的驾考之旅', '开启您的驾考之旅', 1, 0, 0, 0, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 1, 1),
(36, 3, 100102, 2, 1, 3, 2, 'progress_drivelicense', '支付', 'step_2', '', '', '您有报名订单需要支付', '您已支付报考学费{1}元', '您已支付报考学费{1}元', '您的报名订单支付失败，请重新支付', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 2, 1),
(37, 3, 100102, 3, 1, 4, 3, 'progress_messages', '', 'step_3', '', '', '填写个人资料', '您已经填写基本信息', '您已经填写基本信息', '', 1, 1, 1, 0, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 3, 1),
(38, 3, 100102, 4, 1, NULL, NULL, 'progress_messages', '', 'step_4', '', '', '{1}你好,需要您线下邮寄资料给我们，具体资料点击查看详情', '资料已寄出，我们将在收到资料14个工作日内完成报名', '资料正在受理中，请耐心等待', '您邮寄的资料不全，请补寄给我们，具体请点击查看详情', 1, 1, 1, 1, '', '您的资料已收到', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 4, 1),
(39, 3, 100102, 5, 1, 6, 5, 'progress_drivelicense', '', 'step_5', '', '', '资料正在受理中，请耐心等待', '资料正在受理中，请耐心等待', '资料正在受理中，请耐心等待', '', 0, 0, 0, 0, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(40, 3, 100102, 6, 1, 101, NULL, 'progress_drivelicense', '', '', '', '', '资料正在受理中，请耐心等待', '资料正在受理中，请耐心等待', '您已成功报考{1}驾校，报考准驾车型为{2}，流水号为{3}', '受理失败，点击查看详情，喱喱客服将会与您联系', 0, 0, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(41, 3, 100102, 101, 1, 201, 101, 'progress_drivelicense', '', '', '', '', '等待预约理论课', '约课中', '已约理论课', '缺理论课', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(42, 3, 100102, 201, 1, 301, 201, 'progress_drivelicense', '', '', '', '', '未模拟考试', '', '模拟考试达标', '模拟考试未达标', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(43, 3, 100102, 301, 1, 302, 301, 'progress_subjectone', '科目一', '', '', '', '科一约考排队中', '', '科一排队成功', '科一约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(44, 3, 100102, 302, 1, 401, 301, 'progress_subjectone', '', '', '', '', '已约考科一', '', '科一合格', '科一不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(45, 3, 100102, 401, 1, 402, 401, 'progress_subjecttwo', '科目二', '', '', '', '科二约考排队中', '', '科二排队成功', '科二约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(46, 3, 100102, 402, 1, 501, 401, 'progress_subjecttwo', '', '', '', '', '已约考科二', '', '科二合格', '科二不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(47, 3, 100102, 501, 1, 502, 501, 'progress_longtraining', '长训', '', '', '', '长训约考排队中', '', '长训排队成功', '长训约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(48, 3, 100102, 502, 1, 601, 501, 'progress_longtraining', '', '', '', '', '已约考长训', '', '长训合格', '长训不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(49, 3, 100102, 601, 1, 602, 601, 'progress_subjectthree', '科目三', '', '', '', '科三约考排队中', '', '科三排队成功', '科三约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(50, 3, 100102, 602, 1, 701, 601, 'progress_subjectthree', '', '', '', '', '已约考科三', '', '科三合格', '科三不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(51, 3, 100102, 701, 1, NULL, 701, 'progress_subjectfour', '科目四', '', '', '', '已约考科四', '', '已拿证', '科四不合格', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(52, 4, 100103, 1, 1, 2, 1, 'progress_drivelicense', '报名', 'dpage_enrolllist', '', '', '开启您的驾考之旅', '开启您的驾考之旅', '开启您的驾考之旅', '开启您的驾考之旅', 1, 0, 0, 0, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 1, 1),
(53, 4, 100103, 2, 1, 3, 2, 'progress_drivelicense', '支付', 'step_2', '', '', '您有报名订单需要支付', '您已支付报考学费{1}元', '您已支付报考学费{1}元', '您的报名订单支付失败，请重新支付', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 2, 1),
(54, 4, 100103, 3, 1, 4, 3, 'progress_messages', '', 'step_3', '', '', '填写个人资料', '您已经填写基本信息', '您已经填写基本信息', '', 1, 1, 1, 0, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 3, 1),
(55, 4, 100103, 4, 1, NULL, NULL, 'progress_messages', '', 'step_4', '', '', '{1}你好,需要您线下邮寄资料给我们，具体资料点击查看详情', '资料已寄出，我们将在收到资料14个工作日内完成报名', '资料正在受理中，请耐心等待', '您邮寄的资料不全，请补寄给我们，具体请点击查看详情', 1, 1, 1, 1, '', '您的资料已收到', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 4, 1),
(56, 4, 100103, 5, 1, 6, 5, 'progress_drivelicense', '', 'step_5', '', '', '资料正在受理中，请耐心等待', '资料正在受理中，请耐心等待', '资料正在受理中，请耐心等待', '', 0, 0, 0, 0, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(57, 4, 100103, 6, 1, 101, NULL, 'progress_drivelicense', '', '', '', '', '资料正在受理中，请耐心等待', '资料正在受理中，请耐心等待', '您已成功报考{1}驾校，报考准驾车型为{2}，流水号为{3}', '受理失败，点击查看详情，喱喱客服将会与您联系', 0, 0, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(58, 4, 100103, 101, 1, 201, 101, 'progress_drivelicense', '', '', '', '', '等待预约理论课', '约课中', '已约理论课', '缺理论课', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(59, 4, 100103, 201, 1, 301, 201, 'progress_drivelicense', '', '', '', '', '未模拟考试', '', '模拟考试达标', '模拟考试未达标', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(60, 4, 100103, 301, 1, 302, 301, 'progress_subjectone', '科目一', '', '', '', '科一约考排队中', '', '科一排队成功', '科一约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(61, 4, 100103, 302, 1, 401, 301, 'progress_subjectone', '', '', '', '', '已约考科一', '', '科一合格', '科一不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(62, 4, 100103, 401, 1, 402, 401, 'progress_subjecttwo', '科目二', '', '', '', '科二约考排队中', '', '科二排队成功', '科二约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(63, 4, 100103, 402, 1, 501, 401, 'progress_subjecttwo', '', '', '', '', '已约考科二', '', '科二合格', '科二不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(64, 4, 100103, 501, 1, 502, 501, 'progress_longtraining', '长训', '', '', '', '长训约考排队中', '', '长训排队成功', '长训约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(65, 4, 100103, 502, 1, 601, 501, 'progress_longtraining', '', '', '', '', '已约考长训', '', '长训合格', '长训不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(66, 4, 100103, 601, 1, 602, 601, 'progress_subjectthree', '科目三', '', '', '', '科三约考排队中', '', '科三排队成功', '科三约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(67, 4, 100103, 602, 1, 701, 601, 'progress_subjectthree', '', '', '', '', '已约考科三', '', '科三合格', '科三不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(68, 4, 100103, 701, 1, NULL, 701, 'progress_subjectfour', '科目四', '', '', '', '已约考科四', '', '已拿证', '科四不合格', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(69, 5, 102100, 1, 1, 2, 1, 'progress_drivelicense', '报名', 'dpage_enrolllist', '', '', '开启您的驾考之旅', '开启您的驾考之旅', '开启您的驾考之旅', '开启您的驾考之旅', 1, 0, 0, 0, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 1, 1),
(70, 5, 102100, 2, 1, 3, 2, 'progress_drivelicense', '支付', 'step_2', '', '', '您有报名订单需要支付', '您已支付报考学费{1}元', '您已支付报考学费{1}元', '您的报名订单支付失败，请重新支付', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 2, 1),
(71, 5, 102100, 3, 1, 4, 3, 'progress_messages', '', 'step_3', '', '', '填写个人资料', '您已经填写基本信息', '您已经填写基本信息', '', 1, 1, 1, 0, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 3, 1),
(72, 5, 102100, 4, 1, NULL, NULL, 'progress_messages', '', 'step_4', '', '', '{1}你好,需要您线下邮寄资料给我们，具体资料点击查看详情', '资料已寄出，我们将在收到资料14个工作日内完成报名', '资料正在受理中，请耐心等待', '您邮寄的资料不全，请补寄给我们，具体请点击查看详情', 1, 1, 1, 1, '', '您的资料已收到', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 4, 1),
(73, 5, 102100, 5, 1, 6, 5, 'progress_drivelicense', '', 'step_5', '', '', '资料正在受理中，请耐心等待', '资料正在受理中，请耐心等待', '资料正在受理中，请耐心等待', '', 0, 0, 0, 0, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(74, 5, 102100, 6, 1, 101, NULL, 'progress_drivelicense', '', '', '', '', '资料正在受理中，请耐心等待', '资料正在受理中，请耐心等待', '您已成功报考{1}驾校，报考准驾车型为{2}，流水号为{3}', '受理失败，点击查看详情，喱喱客服将会与您联系', 0, 0, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(75, 5, 102100, 101, 1, 201, 101, 'progress_drivelicense', '', '', '', '', '等待预约理论课', '约课中', '已约理论课', '缺理论课', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(76, 5, 102100, 201, 1, 301, 201, 'progress_drivelicense', '', '', '', '', '未模拟考试', '', '模拟考试达标', '模拟考试未达标', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(77, 5, 102100, 301, 1, 302, 301, 'progress_subjectone', '科目一', '', '', '', '科一约考排队中', '', '科一排队成功', '科一约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(78, 5, 102100, 302, 1, 401, 301, 'progress_subjectone', '', '', '', '', '已约考科一', '', '科一合格', '科一不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(79, 5, 102100, 401, 1, 402, 401, 'progress_subjecttwo', '科目二', '', '', '', '科二约考排队中', '', '科二排队成功', '科二约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(80, 5, 102100, 402, 1, 501, 401, 'progress_subjecttwo', '', '', '', '', '已约考科二', '', '科二合格', '科二不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(81, 5, 102100, 501, 1, 502, 501, 'progress_longtraining', '长训', '', '', '', '长训约考排队中', '', '长训排队成功', '长训约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(82, 5, 102100, 502, 1, 601, 501, 'progress_longtraining', '', '', '', '', '已约考长训', '', '长训合格', '长训不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(83, 5, 102100, 601, 1, 602, 601, 'progress_subjectthree', '科目三', '', '', '', '科三约考排队中', '', '科三排队成功', '科三约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(84, 5, 102100, 602, 1, 701, 601, 'progress_subjectthree', '', '', '', '', '已约考科三', '', '科三合格', '科三不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(85, 5, 102100, 701, 1, NULL, 701, 'progress_subjectfour', '科目四', '', '', '', '已约考科四', '', '已拿证', '科四不合格', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(86, 6, 103100, 1, 1, 2, 1, 'progress_drivelicense', '报名', 'dpage_enrolllist', '', '', '开启您的驾考之旅', '开启您的驾考之旅', '开启您的驾考之旅', '开启您的驾考之旅', 1, 0, 0, 0, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 1, 1),
(87, 6, 103100, 2, 1, 3, 2, 'progress_drivelicense', '支付', 'step_2', '', '', '您有报名订单需要支付', '您已支付报考学费{1}元', '您已支付报考学费{1}元', '您的报名订单支付失败，请重新支付', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 2, 1),
(88, 6, 103100, 3, 1, 4, 3, 'progress_messages', '', 'step_3', '', '', '填写个人资料', '您已经填写基本信息', '您已经填写基本信息', '', 1, 1, 1, 0, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 3, 1),
(89, 6, 103100, 4, 1, NULL, NULL, 'progress_messages', '', 'step_4', '', '', '{1}你好,需要您线下邮寄资料给我们，具体资料点击查看详情', '资料已寄出，我们将在收到资料14个工作日内完成报名', '资料正在受理中，请耐心等待', '您邮寄的资料不全，请补寄给我们，具体请点击查看详情', 1, 1, 1, 1, '', '您的资料已收到', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 4, 1),
(90, 6, 103100, 5, 1, 6, 5, 'progress_drivelicense', '', 'step_5', '', '', '资料正在受理中，请耐心等待', '资料正在受理中，请耐心等待', '资料正在受理中，请耐心等待', '', 0, 0, 0, 0, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(91, 6, 103100, 6, 1, 101, NULL, 'progress_drivelicense', '', '', '', '', '资料正在受理中，请耐心等待', '资料正在受理中，请耐心等待', '您已成功报考{1}驾校，报考准驾车型为{2}，流水号为{3}', '受理失败，点击查看详情，喱喱客服将会与您联系', 0, 0, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(92, 6, 103100, 101, 1, 201, 101, 'progress_drivelicense', '', '', '', '', '等待预约理论课', '约课中', '已约理论课', '缺理论课', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(93, 6, 103100, 201, 1, 301, 201, 'progress_drivelicense', '', '', '', '', '未模拟考试', '', '模拟考试达标', '模拟考试未达标', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(94, 6, 103100, 301, 1, 302, 301, 'progress_subjectone', '科目一', '', '', '', '科一约考排队中', '', '科一排队成功', '科一约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(95, 6, 103100, 302, 1, 401, 301, 'progress_subjectone', '', '', '', '', '已约考科一', '', '科一合格', '科一不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(96, 6, 103100, 401, 1, 402, 401, 'progress_subjecttwo', '科目二', '', '', '', '科二约考排队中', '', '科二排队成功', '科二约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(97, 6, 103100, 402, 1, 501, 401, 'progress_subjecttwo', '', '', '', '', '已约考科二', '', '科二合格', '科二不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(98, 6, 103100, 501, 1, 502, 501, 'progress_longtraining', '长训', '', '', '', '长训约考排队中', '', '长训排队成功', '长训约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(99, 6, 103100, 502, 1, 601, 501, 'progress_longtraining', '', '', '', '', '已约考长训', '', '长训合格', '长训不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(100, 6, 103100, 601, 1, 602, 601, 'progress_subjectthree', '科目三', '', '', '', '科三约考排队中', '', '科三排队成功', '科三约考取消中', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(101, 6, 103100, 602, 1, 701, 601, 'progress_subjectthree', '', '', '', '', '已约考科三', '', '科三合格', '科三不合格', 1, 1, 1, 1, '', '', '', 0, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1),
(102, 6, 103100, 701, 1, NULL, 701, 'progress_subjectfour', '科目四', '', '', '', '已约考科四', '', '已拿证', '科四不合格', 1, 1, 1, 1, '', '', '', 1, 0, 1, '1,2,3,4,5', '6,7,8', 5, 1);



--  redis-cli -a chelizi keys *template* |xargs redis-cli -a chelizi del





